# Introdução ao Pandas - Continuação

In [1]:
import pandas as pd
import numpy as np

In [2]:
# definimos um dataframe para iniciarmos
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
# temos valores faisna()ltantes? isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

A    1
B    2
C    0
dtype: int64

In [6]:
# como podemos remover esses registros? dropna()

     A    B  C
0  1.0  5.0  1

   C
0  1
1  2
2  3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
# como podemos preencher esses registros com problemas? fillna()

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

              A             B  C
0           1.0           5.0  1
1           2.0  sem registro  2
2  sem registro  sem registro  3

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [13]:
# Verificar a quantidade valores exclusivos

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

array([1., 2.])

2

1.0    2
2.0    1
Name: A, dtype: int64

0          palavra
1            texto
2              NaN
3    outra_palavra
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

0             None
1            texto
2              NaN
3    outra_palavra
dtype: object

0     True
1    False
2     True
3    False
dtype: bool

0             None
1
2              NaN
3    outra_palavra
dtype: object

0     True
1    False
2     True
3    False
dtype: bool

#### Operações

In [25]:
# Media

A    1.5
B    5.0
C    2.0
dtype: float64

In [26]:
#Mediana

A    1.5
B    5.0
C    2.0
dtype: float64

In [27]:
#Soma

A    3.0
B    5.0
C    6.0
dtype: float64

In [28]:
#Max e Min
print(df.max())
print(df.min())

A    2.0
B    5.0
C    3.0
dtype: float64
A    1.0
B    5.0
C    1.0
dtype: float64

In [29]:
#Desvio Padrao
df.std()

A    0.707107
B         NaN
C    1.000000
dtype: float64

In [30]:
df.fillna(0).std().max()

2.8867513459481287

In [31]:
list(df.columns)

['A', 'B', 'C']

In [32]:
# Navegar dentro do dataframe, 
#fazendo um teste especifico para o valor em uma célula.

Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo
Não encontrei nenhum valor negativo

In [33]:
dados2 = pd.DataFrame({'k1': ['A','B']*3 + ['B'],
                       'k2': [1,1,2,3,3,4,4]})

In [34]:
dados2

  k1  k2
0  A   1
1  B   1
2  A   2
3  B   3
4  A   3
5  B   4
6  B   4

In [35]:
dados2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
dados2.drop_duplicates()

  k1  k2
0  A   1
1  B   1
2  A   2
3  B   3
4  A   3
5  B   4

### Concatenação

Concatenar = 'colar' DataFrames. Tem que ter as dimensões iguais do eixo que estaremos utiizando. Comando **pd.concat**.

In [37]:
# vamos definir 3 conjuntos de dados para exercitar essas possibilidades
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [38]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [39]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [40]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [41]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [42]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Mesclar

Permite mesclar os conjuntos de dados 'like a joins' que usamos no SQL.

In [43]:
# novos conjuntos
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [44]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [45]:
direitaesquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [46]:
pd.merge(esquerda, direita, on='key', how='inner')

KeyError: 'key'

In [ ]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
pd.merge(esquerda, direita, on=['key1','key2'])

In [ ]:
pd.merge(esquerda, direita, on=['key1','key2'], how='outer')

In [ ]:
pd.merge(esquerda, direita, on=['key1','key2'], how='right')

In [ ]:
pd.merge(esquerda, direita, on=['key1','key2'], how='left')

In [ ]:
df4 = pd.DataFrame({
    'chave_esq' : ['b', 'b', 'a', 'c', 'c'],
    'valores_esq' : range(5)
})

df5 = pd.DataFrame({
    'chave_dir' : ['a', 'b', 'd'],
    'valores_dir' : range(3)
})

In [ ]:
df4

In [ ]:
df5

In [ ]:
pd.merge(df4, df5, left_on='chave_esq', right_on='chave_dir', how='left')

In [ ]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})

In [ ]:
df1.merge(df2, how='cross')

### Juntar

Combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame.

In [ ]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
esquerda.join(direita)

In [ ]:
esquerda.join(direita, how='outer')

In [ ]:
esquerda.join(direita, how='right')

In [ ]:
# Como eu sei qual é o tamanho do meu conjunto de dados?
esquerda.shape

In [ ]:
novo_conj = esquerda.join(direita, how='right')

In [ ]:
type(novo_conj)

In [ ]:
novo_conj.shape

In [ ]:
novo_conj.dtypes

In [ ]:
df

In [ ]:
df.dtypes

In [ ]:
# Aplicando funcoes
df7 = pd.DataFrame({'col1' : [1,2,3],
                    'col2' : [55,66,77],
                    'col3' : ['abc', 'def', 'ghi']})

In [ ]:
df7

In [ ]:
def multiplica_2(x):
    return x*2

In [ ]:
df7['nova_coluna'] = df7['col1'].apply(multiplica_2)

In [ ]:
df7['col2'].apply(multiplica_2)

In [ ]:
df7['col3'].apply(len)

In [ ]:
df7['col1'].apply(lambda x : x*3)